In [30]:
import pandas as pd

DDL = pd.read_csv("DDL.csv", index_col=0)
SPIDER = pd.read_csv("SPIDER_250.csv", index_col=0)
merged_df = pd.merge(SPIDER, DDL, on='db_id', how='left')
merged_df.to_csv("DATASET.csv")

In [32]:
dataset = pd.read_csv("DATASET.csv")
dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 250 entries, 0 to 249
Data columns (total 17 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Unnamed: 0           250 non-null    int64
 1   original_idx         250 non-null    int64
 2   db_id                250 non-null    object
 3   query                250 non-null    object
 4   question             250 non-null    object
 5   query_toks           250 non-null    object
 6   query_toks_no_value  250 non-null    object
 7   question_toks        250 non-null    object
 8   HAVING               250 non-null    int64
 9   ORDER BY             250 non-null    int64
 10  GROUP BY             250 non-null    int64
 11  JOIN                 250 non-null    int64
 12  SELECT               250 non-null    int64
 13  CREATE               249 non-null    object
 14  INSERT               224 non-null    object
 15  extracted_words      249 non-null    object
 16  word_count           249 non-null    float64
dtypes: float64(1), int64(7), object(9)
memory usage: 33.3+ KB

In [42]:
SPIDER[SPIDER['db_id']!='music_2'].to_csv("SPIDER_248.csv")

In [43]:
SPIDER

,original_idx,db_id,query,question,query_toks,query_toks_no_value,question_toks,HAVING,ORDER BY,GROUP BY,JOIN,SELECT
0,11,department_management,SELECT count(*) FROM department WHERE departme...,How many departments are led by heads who are ...,['SELECT' 'count' '(' '*' ')' 'FROM' 'departme...,['select' 'count' '(' '*' ')' 'from' 'departme...,['How' 'many' 'departments' 'are' 'led' 'by' '...,0,0,0,0,2
1,13,department_management,SELECT T3.born_state FROM department AS T1 JOI...,List the states where both the secretary of 'T...,['SELECT' 'T3.born_state' 'FROM' 'department' ...,['select' 't3' '.' 'born_state' 'from' 'depart...,['List' 'the' 'states' 'where' 'both' 'the' 's...,0,0,0,4,2
2,14,department_management,"SELECT T1.department_id , T1.name , count(*)...",Which department has more than 1 head at a tim...,"['SELECT' 'T1.department_id' ',' 'T1.name' ','...","['select' 't1' '.' 'department_id' ',' 't1' '....",['Which' 'department' 'has' 'more' 'than' '1' ...,1,0,1,1,1
3,36,farm,SELECT T1.Official_Name FROM city AS T1 JOIN f...,Show the official names of the cities that hav...,['SELECT' 'T1.Official_Name' 'FROM' 'city' 'AS...,['select' 't1' '.' 'official_name' 'from' 'cit...,['Show' 'the' 'official' 'names' 'of' 'the' 'c...,1,0,1,1,1
4,37,farm,SELECT T1.Official_Name FROM city AS T1 JOIN f...,What are the official names of cities that hav...,['SELECT' 'T1.Official_Name' 'FROM' 'city' 'AS...,['select' 't1' '.' 'official_name' 'from' 'cit...,['What' 'are' 'the' 'official' 'names' 'of' 'c...,1,0,1,1,1
...,...,...,...,...,...,...,...,...,...,...,...,...
45,7937,dog_kennels,"SELECT T1.owner_id , T1.last_name FROM Owners...",Tell me the owner id and last name of the owne...,"['SELECT' 'T1.owner_id' ',' 'T1.last_name' 'FR...","['select' 't1' '.' 'owner_id' ',' 't1' '.' 'la...",['Tell' 'me' 'the' 'owner' 'id' 'and' 'last' '...,0,1,1,2,1
46,7940,dog_kennels,"SELECT T1.owner_id , T1.zip_code FROM Owners ...",Which owner has paid the largest amount of mon...,"['SELECT' 'T1.owner_id' ',' 'T1.zip_code' 'FRO...","['select' 't1' '.' 'owner_id' ',' 't1' '.' 'zi...",['Which' 'owner' 'has' 'paid' 'the' 'largest' ...,0,1,1,2,1
47,7941,dog_kennels,"SELECT T1.owner_id , T1.zip_code FROM Owners ...",Find the owner id and zip code of the owner wh...,"['SELECT' 'T1.owner_id' ',' 'T1.zip_code' 'FRO...","['select' 't1' '.' 'owner_id' ',' 't1' '.' 'zi...",['Find' 'the' 'owner' 'id' 'and' 'zip' 'code' ...,0,1,1,2,1
48,7954,dog_kennels,"SELECT T1.name , T2.date_of_treatment FROM Do...",List the names of the dogs of the rarest breed...,"['SELECT' 'T1.name' ',' 'T2.date_of_treatment'...","['select' 't1' '.' 'name' ',' 't2' '.' 'date_o...",['List' 'the' 'names' 'of' 'the' 'dogs' 'of' '...,0,1,1,1,2
49,7955,dog_kennels,"SELECT T1.name , T2.date_of_treatment FROM Do...",Which dogs are of the rarest breed? Show their...,"['SELECT' 'T1.name' ',' 'T2.date_of_treatment'...","['select' 't1' '.' 'name' ',' 't2' '.' 'date_o...",['Which' 'dogs' 'are' 'of' 'the' 'rarest' 'bre...,0,1,1,1,2